# Section 10: Updating Values

In [1]:
from pathlib import Path

import pandas as pd

In [2]:
# Path to data directory
data_dir = Path.cwd() / "course_materials" / "data"

In [3]:
####### NOTE DATAFRAME NAME CHANGES TO MATCH COURSE
# King's County housing dataset
houses_df = pd.read_csv(data_dir / "kc_house_data.csv")

# Titanic Passenger dataset
titanic_df = pd.read_csv(data_dir / "titanic.csv")

# Netflix dataset
netflix_df = pd.read_csv(data_dir / "netflix_titles.csv", sep="|", index_col=0)

# Bitcoin dataset
btc_df = pd.read_csv(data_dir / "coin_Bitcoin.csv")

# World Happiness Index dataset
countries_df = pd.read_csv(
    data_dir / "world-happiness-report-2021.csv", index_col="Country name"
)

In [6]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1309 non-null   object
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: int64(4), object(10)
memory usage: 143.3+ KB

### Casting Types With astype()

In [7]:
titanic_df["age"].value_counts()

?         263
24         47
22         43
21         41
30         40
         ...
66          1
0.6667      1
76          1
67          1
26.5        1
Name: age, Length: 99, dtype: int64

In [8]:
# First replace the `?` characters in the `age` column
titanic_df["age"].replace(["?"], [None], inplace=True)

In [9]:
titanic_df["age"].value_counts()

24        47
22        43
21        41
30        40
18        39
          ..
0.3333     1
22.5       1
70.5       1
0.6667     1
26.5       1
Name: age, Length: 98, dtype: int64

In [10]:
titanic_df["age"].value_counts(dropna=False)

None      263
24         47
22         43
21         41
30         40
         ...
66          1
0.6667      1
76          1
67          1
26.5        1
Name: age, Length: 99, dtype: int64

In [23]:
titanic_df["age"] = titanic_df["age"].astype("float")

In [25]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: float64(1), int64(4), object(9)
memory usage: 143.3+ KB

In [26]:
titanic_df["age"].mean()

29.8811345124283

### Category Type

In [28]:
titanic_df["sex"] = titanic_df["sex"].astype("category")

In [29]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   category
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: category(1), float64(1), int64(4), object(8)
memory usage: 134.5+ KB

In [33]:
titanic_df["embarked"] = titanic_df["embarked"].astype("category")

In [34]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   category
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   category
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: category(2), float64(1), int64(4), object(7)
memory usage: 125.7+ KB

In [35]:
titanic_df["embarked"].astype("category")

0       S
1       S
2       S
3       S
4       S
       ..
1304    C
1305    C
1306    C
1307    C
1308    S
Name: embarked, Length: 1309, dtype: category
Categories (4, object): ['?', 'C', 'Q', 'S']

### Casting With pd.to_numeric()

In [36]:
# Re-read the dataset to start fresh
# Titanic Passenger dataset
titanic_df = pd.read_csv(data_dir / "titanic.csv")

In [37]:
titanic_df["age"].value_counts()

?         263
24         47
22         43
21         41
30         40
         ...
66          1
0.6667      1
76          1
67          1
26.5        1
Name: age, Length: 99, dtype: int64

In [40]:
pd.to_numeric(titanic_df["age"], errors="coerce").value_counts(dropna=False)

NaN        263
24.0000     47
22.0000     43
21.0000     41
30.0000     40
          ...
66.0000      1
0.6667       1
76.0000      1
67.0000      1
26.5000      1
Name: age, Length: 99, dtype: int64

In [41]:
titanic_df["age"] = pd.to_numeric(titanic_df["age"], errors="coerce")

In [42]:
titanic_df["age"].value_counts(dropna=False)

NaN        263
24.0000     47
22.0000     43
21.0000     41
30.0000     40
          ...
66.0000      1
0.6667       1
76.0000      1
67.0000      1
26.5000      1
Name: age, Length: 99, dtype: int64

In [43]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: float64(1), int64(4), object(9)
memory usage: 143.3+ KB

### dropna() and isna()

In [44]:
# Game Stats dataset
stats_df = pd.read_csv(data_dir / "game_stats.csv")

In [45]:
stats_df

       name      league  points  assists  rebounds
0       bob         nba    22.0      5.0      10.0
1    jessie         NaN    10.0      NaN       2.0
2       stu  euroleague     NaN      NaN       NaN
3   jackson         aba     9.0      NaN       2.0
4  timothee         NaN     8.0      NaN       NaN
5     steph         nba    49.0      8.0      10.0
6       NaN         NaN     NaN      NaN       NaN

In [47]:
stats_df.isna()

    name  league  points  assists  rebounds
0  False   False   False    False     False
1  False    True   False     True     False
2  False   False    True     True      True
3  False   False   False     True     False
4  False    True   False     True      True
5  False   False   False    False     False
6   True    True    True     True      True

In [48]:
stats_df["league"].isna()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
Name: league, dtype: bool

In [50]:
# Return the rows that don't have a league value
stats_df[stats_df["league"].isna()]

       name league  points  assists  rebounds
1    jessie    NaN    10.0      NaN       2.0
4  timothee    NaN     8.0      NaN       NaN
6       NaN    NaN     NaN      NaN       NaN

In [55]:
assists = stats_df["assists"]
assists

0    5.0
1    NaN
2    NaN
3    NaN
4    NaN
5    8.0
6    NaN
Name: assists, dtype: float64

In [56]:
assists.dropna(inplace=True)

In [57]:
assists

0    5.0
5    8.0
Name: assists, dtype: float64

In [59]:
# Only the rows that have no null values are returned
stats_df.dropna()

    name league  points  assists  rebounds
0    bob    nba    22.0      5.0      10.0
5  steph    nba    49.0      8.0      10.0

In [61]:
# Drop only rows that have all null values
stats_df.dropna(how="all")

       name      league  points  assists  rebounds
0       bob         nba    22.0      5.0      10.0
1    jessie         NaN    10.0      NaN       2.0
2       stu  euroleague     NaN      NaN       NaN
3   jackson         aba     9.0      NaN       2.0
4  timothee         NaN     8.0      NaN       NaN
5     steph         nba    49.0      8.0      10.0

In [63]:
# Drop rows that have null values in the league column
stats_df.dropna(subset=["league"])

      name      league  points  assists  rebounds
0      bob         nba    22.0      5.0      10.0
2      stu  euroleague     NaN      NaN       NaN
3  jackson         aba     9.0      NaN       2.0
5    steph         nba    49.0      8.0      10.0

### fillna()

In [65]:
stats_df.fillna(0)

       name      league  points  assists  rebounds
0       bob         nba    22.0      5.0      10.0
1    jessie           0    10.0      0.0       2.0
2       stu  euroleague     0.0      0.0       0.0
3   jackson         aba     9.0      0.0       2.0
4  timothee           0     8.0      0.0       0.0
5     steph         nba    49.0      8.0      10.0
6         0           0     0.0      0.0       0.0

In [68]:
stats_df["league"].fillna("amateur", inplace=True)

In [69]:
stats_df

       name      league  points  assists  rebounds
0       bob         nba    22.0      5.0      10.0
1    jessie     amateur    10.0      NaN       2.0
2       stu  euroleague     NaN      NaN       NaN
3   jackson         aba     9.0      NaN       2.0
4  timothee     amateur     8.0      NaN       NaN
5     steph         nba    49.0      8.0      10.0
6       NaN     amateur     NaN      NaN       NaN

In [71]:
stats_df.fillna(value={"points": 0, "assists": "None"})

       name      league  points assists  rebounds
0       bob         nba    22.0     5.0      10.0
1    jessie     amateur    10.0    None       2.0
2       stu  euroleague     0.0    None       NaN
3   jackson         aba     9.0    None       2.0
4  timothee     amateur     8.0    None       NaN
5     steph         nba    49.0     8.0      10.0
6       NaN     amateur     0.0    None       NaN

In [72]:
# Sales dataset
sales_df = pd.read_csv(data_dir / "sales.csv")

In [73]:
sales_df

   rating  shipping_zip  billing_zip
0     5.0           NaN      81220.0
1     4.5       94931.0      94931.0
2     NaN       92625.0      92625.0
3     4.5       10003.0      10003.0
4     4.0           NaN      92660.0
5     NaN           NaN          NaN
6     NaN       60007.0      60007.0

In [76]:
sales_df["shipping_zip"].fillna(sales_df["billing_zip"], inplace=True)

In [77]:
sales_df

   rating  shipping_zip  billing_zip
0     5.0       81220.0      81220.0
1     4.5       94931.0      94931.0
2     NaN       92625.0      92625.0
3     4.5       10003.0      10003.0
4     4.0       92660.0      92660.0
5     NaN           NaN          NaN
6     NaN       60007.0      60007.0